{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How can I help you?",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello! Welcome to our drugstore.",
        "Hi there, how can we assist you today?",
        "Good day! How may we help you?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, and thank you for choosing our drugstore.",
        "Have a nice day! If you need anything, feel free to return.",
        "Goodbye! Come back again soon for all your healthcare needs."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["You're welcome! If you have more questions, feel free to ask.", "Any time! Your health is our priority.", "It's my pleasure to assist you."]
    },
    {
      "tag": "products",
      "patterns": [
        "What medications do you have?",
        "Tell me about your products.",
        "What's in stock?"
      ],
      "responses": [
        "We offer a variety of medications including Sildenafil, Hydrocortisone Acetate, Salicylic Acid, and more.",
        "Our product range includes Sildenafil, Hydrocortisone Acetate, Salicylic Acid, and many others.",
        "At our drugstore, you can find medications like Sildenafil, Hydrocortisone Acetate, Salicylic Acid, and more for your health needs."
      ]
    },
    {
      "tag": "payment",
      "patterns": [
        "Do you accept credit cards?",
        "What payment methods do you support?",
        "Can I use PayPal?"
      ],
      "responses": [
        "We accept various payment methods, including credit cards (VISA, Mastercard) and Paypal.",
        "You can pay with VISA, Mastercard, and even Paypal at our drugstore.",
        "We support multiple payment options, such as credit cards (VISA, Mastercard) and Paypal."
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "How long does delivery take?",
        "When will I receive my order?",
        "Tell me about shipping times."
      ],
      "responses": [
        "Delivery usually takes 2-4 days, and we aim to get your order to you as quickly as possible.",
        "Our shipping times are typically 2-4 days to ensure you receive your order promptly.",
        "Expect your delivery within 2-4 days as we strive to provide efficient shipping services."
      ]
    },
    {
      "tag": "humor",
      "patterns": [
        "Tell me a joke!",
        "Make me laugh!",
        "Do you have a funny story?"
      ],
      "responses": [
        "Sure, here's a pharmacy joke for you: Why did the pill go to therapy? It had too many issues!",
        "In need of a chuckle? How about this one: Why did the vitamin go to school? It wanted to be a smarty-pants!",
        "Laughter is great medicine! Here's a joke: Why did the pharmacy give the computer cold medicine? It had a virus!"
      ]
    }
  ]
}
